application/deployment/benchmarking/test-4threads-4connections-4services-10mins.txt
Running 10m test @ http://0.0.0.0:9000/products/1
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.692ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.818ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.811ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.769ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.04ms   54.20ms 871.94ms   98.14%
    Req/Sec   262.67     74.53     1.11k    96.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.80ms
 75.000%    2.05ms
 90.000%    2.35ms
 99.000%  221.18ms
 99.900%  778.75ms
 99.990%  836.09ms
 99.999%  861.18ms
100.000%  872.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.727     0.000000            1         1.00
       1.215     0.100000        59290         1.11
       1.384     0.200000       118143         1.25
       1.539     0.300000       177266         1.43
       1.676     0.400000       236008         1.67
       1.797     0.500000       295257         2.00
       1.850     0.550000       324756         2.22
       1.900     0.600000       354588         2.50
       1.947     0.650000       383715         2.86
       1.996     0.700000       413218         3.33
       2.051     0.750000       442847         4.00
       2.083     0.775000       457830         4.44
       2.117     0.800000       472072         5.00
       2.159     0.825000       487108         5.71
       2.207     0.850000       501607         6.67
       2.269     0.875000       516720         8.00
       2.305     0.887500       523919         8.89
       2.347     0.900000       531218        10.00
       2.397     0.912500       538422        11.43
       2.461     0.925000       545926        13.33
       2.553     0.937500       553223        16.00
       2.623     0.943750       556894        17.78
       2.731     0.950000       560501        20.00
       2.945     0.956250       564195        22.86
       3.379     0.962500       567876        26.67
       5.611     0.968750       571560        32.00
       8.147     0.971875       573405        35.56
      16.703     0.975000       575249        40.00
      35.199     0.978125       577090        45.71
      60.543     0.981250       578934        53.33
      99.583     0.984375       580779        64.00
     126.271     0.985938       581702        71.11
     155.263     0.987500       582624        80.00
     191.487     0.989062       583543        91.43
     240.895     0.990625       584466       106.67
     294.143     0.992188       585391       128.00
     329.215     0.992969       585850       142.22
     367.103     0.993750       586309       160.00
     417.023     0.994531       586771       182.86
     496.895     0.995313       587232       213.33
     564.735     0.996094       587692       256.00
     599.039     0.996484       587923       284.44
     633.855     0.996875       588154       320.00
     662.527     0.997266       588383       365.71
     692.735     0.997656       588615       426.67
     726.527     0.998047       588847       512.00
     740.351     0.998242       588962       568.89
     753.663     0.998437       589076       640.00
     762.367     0.998633       589190       731.43
     771.071     0.998828       589306       853.33
     779.775     0.999023       589425      1024.00
     783.871     0.999121       589479      1137.78
     788.479     0.999219       589546      1280.00
     793.599     0.999316       589598      1462.86
     798.207     0.999414       589656      1706.67
     802.303     0.999512       589708      2048.00
     804.863     0.999561       589740      2275.56
     807.935     0.999609       589771      2560.00
     810.495     0.999658       589795      2925.71
     814.079     0.999707       589827      3413.33
     818.175     0.999756       589853      4096.00
     820.223     0.999780       589868      4551.11
     822.271     0.999805       589882      5120.00
     824.831     0.999829       589899      5851.43
     827.391     0.999854       589910      6826.67
     831.487     0.999878       589924      8192.00
     835.071     0.999890       589933      9102.22
     837.631     0.999902       589941     10240.00
     840.191     0.999915       589946     11702.86
     843.263     0.999927       589953     13653.33
     846.335     0.999939       589960     16384.00
     847.871     0.999945       589964     18204.44
     850.431     0.999951       589969     20480.00
     851.455     0.999957       589971     23405.71
     853.503     0.999963       589975     27306.67
     855.551     0.999969       589978     32768.00
     857.087     0.999973       589982     36408.89
     857.087     0.999976       589982     40960.00
     858.623     0.999979       589984     46811.43
     859.647     0.999982       589987     54613.33
     859.647     0.999985       589987     65536.00
     860.159     0.999986       589988     72817.78
     860.671     0.999988       589989     81920.00
     861.183     0.999989       589990     93622.86
     862.719     0.999991       589991    109226.67
     864.255     0.999992       589992    131072.00
     864.255     0.999993       589992    145635.56
     866.815     0.999994       589993    163840.00
     866.815     0.999995       589993    187245.71
     868.863     0.999995       589994    218453.33
     868.863     0.999996       589994    262144.00
     868.863     0.999997       589994    291271.11
     870.911     0.999997       589995    327680.00
     870.911     0.999997       589995    374491.43
     870.911     0.999998       589995    436906.67
     870.911     0.999998       589995    524288.00
     870.911     0.999998       589995    582542.22
     872.447     0.999998       589996    655360.00
     872.447     1.000000       589996          inf
#[Mean    =        8.044, StdDeviation   =       54.200]
#[Max     =      871.936, Total count    =       589996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  600004 requests in 10.00m, 101.28MB read
Requests/sec:   1000.00
Transfer/sec:    172.85KB